#+PROPERTY: header-args :tangle yes

* Figure out if we're at work or home

#+begin_src emacs-lisp
  (message "Starting up org-mode init file")
  (setq is-linux (and (getenv "DISPLAY") (if (string= system-type "gnu/linux") t nil)))
  (setq my-org-files (list "~/init/org/Capture.org.gpg" "~/init/org/other.org.gpg" "~/init/org/home.org.gpg" "~/init/org/vec.org.gpg" "~/init/org/journal.org.gpg"))
  ;; Exclude if at work
  (setq my-org-files (if (file-directory-p "/home/kofoed") (remove "~/init/org/other.org.gpg" my-org-files) my-org-files))
#+end_src

#+RESULTS:
| ~/init/org/Capture.org.gpg | ~/init/org/home.org.gpg | ~/init/org/vec.org.gpg | ~/init/org/journal.org.gpg |

** Shell and programming

Using *eat* as main shell for now, works reasonably well, and seems to
be a better term emulator than ansi-term. Treemacs makes projects
easier.

#+begin_src emacs-lisp
  (use-package cider)
  (use-package eat
    :config
    (define-key eat-semi-char-mode-map (kbd "M-o") 'ace-window)
    (define-key eat-semi-char-mode-map (kbd "M-0") 'treemacs-select-window))
  (define-key eat-semi-char-mode-map (kbd "M-a") (lambda () (interactive) (switch-to-buffer "*Org Agenda*")))
  (add-hook 'window-configuration-change-hook
            (lambda ()
              (when (string-equal major-mode "eat-mode")
                (unless (bound-and-true-p called-once)
                                          ;(eat-term-send-string eat-terminal "exec $SHELL -l")
                  (eat-term-send-string eat-terminal "if [[ \"$(hostname)\" == \"dsc005\" ]];then ssh dsc001;fi")
                  (eat-self-input 1 'return)
                  (setq-local called-once t)))))
#+end_src

#+RESULTS:
| (lambda nil (when (string-equal major-mode eat-mode) (unless (bound-and-true-p called-once) (eat-term-send-string eat-terminal if [[ "$(hostname)" == "dsc005" ]];then ssh dsc001;fi) (eat-self-input 1 (quote return)) (setq-local called-once t)))) | dimmer-config-change-handler | window--adjust-process-windows |

Project management

Using treemacs for now. Apparently a package called projectile might be useful.

#+begin_src emacs-lisp
  (use-package treemacs
    :bind (("M-0" . treemacs-select-window)
           ("M-o" . ace-window)))
#+end_src

#+RESULTS:
: ace-window

** Coloring of keywords and marking random text + fic

Fic-mode should work everywhere, hightlight actions and FIXME
etc. Markerpen is manually downloaded.

#+begin_src emacs-lisp
  (require 'markerpen)

  (use-package fic-mode :ensure t)
  (setq p-modes '(tcl-mode-hook ruby-mode-hook perl-mode-hook cperl-mode-hook emacs-lisp-mode-hook python-mode-hook))
  (mapcar (lambda (mode) (add-hook mode 'fic-mode)) p-modes)
  (setq fic-highlighted-words '("FIXME" "TODO" "NOTE" "KLUDGE" "BUG"))
#+end_src

#+RESULTS:
| FIXME | TODO | NOTE | KLUDGE | BUG |

*** Main setup

Perhaps use :bind to improve readability below?

#+begin_src emacs-lisp
  (use-package org
    :pin gnu
    :config
    (setq org-log-done 'time)
    (setq org-return-follows-link t)
    (add-hook 'org-mode-hook 'org-indent-mode)
    (add-hook 'org-mode-hook 'hl-line-mode)
    (add-hook 'org-agenda-mode-hook 'hl-line-mode)
    (define-key org-mode-map (kbd "C-c <up>") 'org-priority-up)
    (define-key org-mode-map (kbd "C-c <down>") 'org-priority-down)
    (define-key global-map "\C-cl" 'org-store-link)
    (define-key global-map "\C-ca" 'org-agenda)
    (define-key global-map "\C-cc" 'org-capture)
    ;(setq org-directory "~/init/org")
    (setq org-default-notes-file "~/init/org/Capture.org.gpg")
    (setq org-agenda-files my-org-files)
    (define-key org-mode-map (kbd "C-c C-g C-r") 'org-shiftmetaright)
    (setq org-hide-emphasis-markers t)
    (setq org-agenda-window-setup 'current-window)
    (setq org-agenda-restore-windows-after-quit t)
    (setq org-agenda-skip-scheduled-if-done t)
    ;(setq org-agenda-skip-function-global '(org-agenda-skip-entry-if 'todo 'done))
    )
  (setq org-refile-targets '((nil :maxlevel . 9)
                             (org-agenda-files :maxlevel . 9)))
  (setq org-todo-keywords
        '((sequence "TODO" "WAIT" "|" "CANCELLED" "DONE")))
#+end_src

#+RESULTS:
| sequence | TODO | WAIT |   |   | CANCELLED | DONE |

*** Setup of org templates (C-c c), creating actions distributed across multiple files

Here are templates for capturing tasks for December 2024, focused on VEC project at work

#+begin_src emacs-lisp
  (setq outline-minor-mode-cycle t)

  (setq org-capture-templates
        '(("t" "General task"       entry (file+regexp org-default-notes-file "Tasks") "* TODO %?\n  %i\n  %a")
          ("c" "C2C task"           entry (file+headline "~/init/org/vec.org.gpg" "C2C tasks" ) "* TODO %?\n  %i\n  %a")
          ("p" "PCIE task"          entry (file+headline "~/init/org/vec.org.gpg" "PCIE tasks") "* TODO %?\n  %i\n  %a")
          ("v" "VEC top-level task" entry (file+regexp "~/init/org/vec.org.gpg" "VEC Top.*" ) "* TODO %?\n  %i\n  %a")
          ("e" "Emacs task"         entry (file+headline "~/init/org/home.org.gpg" "Emacs Tasks") "* TODO %?\n  %i\n  %a")
          ("l" "Clojure task"       entry (file+headline "~/init/org/home.org.gpg" "Clojure Tasks") "* TODO %?\n  %i\n  %a")
          ("j" "Journal"            entry (file+datetree "~/init/org/journal.org.gpg")
           "* %?\nEntered on %U\n%i\n  %a")))

  (setq org-agenda-custom-commands
        '(("u" "Untagged tasks" tags-todo "-{.*}")))
  ;	("d" "Daily Agenda"
  ;	 ((agenda "" ((org-agenda-span 'day)
  ;		      (org-deadline-warning-days 7)))))))
#+end_src

#+RESULTS:
| u | Untagged tasks | tags-todo | -{.*} |

*** Org subtasks and helm-org

Procedure for inserting sub-task , have not really used this yet

#+begin_src emacs-lisp
  (defun my-org-insert-sub-task ()
    (interactive)
    (let ((parent-deadline (org-get-deadline-time nil)))
      (org-goto-sibling)
      (org-insert-todo-subheading t)
      (when parent-deadline
        (org-deadline nil parent-deadline))))
  (define-key org-mode-map (kbd "C-c s") 'my-org-insert-sub-task)
#+end_src

#+RESULTS:
: my-org-insert-sub-task

The helm-org below I've not got to work yet, not sure what it does !

#+begin_src emacs-lisp
      (use-package helm-org
        ;:config
        ;(add-to-list 'helm-completing-read-handlers-alist '(org-capture . helm-org-completing-read-tags))
        ;(add-to-list 'helm-completing-read-handlers-alist '(org-set-tags . helm-org-completing-read-tags))
        )
      (add-hook 'helm-mode-hook
                (lambda ()
                  (add-to-list 'helm-completing-read-handlers-alist '(org-capture . helm-org-completing-read-tags))
                  (add-to-list 'helm-completing-read-handlers-alist '(org-set-tags . helm-org-completing-read-tags))))
#+end_src

#+RESULTS:
| lambda | nil | (add-to-list (quote helm-completing-read-handlers-alist) (quote (org-capture . helm-org-completing-read-tags))) | (add-to-list (quote helm-completing-read-handlers-alist) (quote (org-set-tags . helm-org-completing-read-tags))) |

** Emacs shell setup

#+begin_src emacs-lisp
  (autoload 'ansi-color-for-comint-mode-on "ansi-color" nil t)
  (add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
  (add-hook 'shell-mode-hook (lambda () (face-remap-set-base 'comint-highlight-prompt :inherit nil)))

  (setq display-buffer-alist '(("\\`\\*e?shell" display-buffer-same-window)))

  (setq ansi-color-names-vector
        ["black" "tomato" "PaleGreen2" "gold1"
         "DeepSkyBlue1" "MediumOrchid1" "cyan" "white"])
  (setq ansi-color-names-vector
        ["black" "tomato" "PaleGreen2" "gold1"
         "blue" "MediumOrchid1" "cyan" "white"])
  ;; NOTE Fix ansi-term keys we want(!)
  (add-hook 'term-mode-hook (lambda () (define-key term-raw-map (kbd "M-o") 'ace-window)))
  (add-hook 'term-mode-hook (lambda () (define-key term-raw-map (kbd "M-0") 'treemacs-select-window)))
  (add-hook 'term-mode-hook (lambda () (define-key term-raw-map (kbd "M-x") 'helm-M-x)))

#+end_src

#+RESULTS:
| lambda | nil | (define-key term-raw-map (kbd M-x) (quote helm-M-x))               |
| lambda | nil | (define-key term-raw-map (kbd M-0) (quote treemacs-select-window)) |
| lambda | nil | (define-key term-raw-map (kbd M-o) (quote ace-window))             |

** Test M-a as switch to agenda

#+begin_src emacs-lisp
  (global-set-key (kbd "M-a") (lambda () (interactive) (switch-to-buffer "*Org Agenda*")))
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (switch-to-buffer *Org Agenda*) |

